MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32L4Q5VG/mcu.h
/********************  Bit definition for PWR_PUCRH register  ********************/
#define PWR_PUCRH_PH15_Pos           (15U)
#define PWR_PUCRH_PH15_Msk           (0x1UL << PWR_PUCRH_PH15_Pos)             /*!< 0x00008000 */
#define PWR_PUCRH_PH15               PWR_PUCRH_PH15_Msk                        /*!< Port PH15 Pull-Up set  */
#define PWR_PUCRH_PH14_Pos           (14U)
#define PWR_PUCRH_PH14_Msk           (0x1UL << PWR_PUCRH_PH14_Pos)             /*!< 0x00004000 */
#define PWR_PUCRH_PH14               PWR_PUCRH_PH14_Msk                        /*!< Port PH14 Pull-Up set  */
#define PWR_PUCRH_PH13_Pos           (13U)
#define PWR_PUCRH_PH13_Msk           (0x1UL << PWR_PUCRH_PH13_Pos)             /*!< 0x00002000 */
#define PWR_PUCRH_PH13               PWR_PUCRH_PH13_Msk                        /*!< Port PH13 Pull-Up set  */
#define PWR_PUCRH_PH12_Pos           (12U)
#define PWR_PUCRH_PH12_Msk           (0x1UL << PWR_PUCRH_PH12_Pos)             /*!< 0x00001000 */
#define PWR_PUCRH_PH12               PWR_PUCRH_PH12_Msk                        /*!< Port PH12 Pull-Up set  */
#define PWR_PUCRH_PH11_Pos           (11U)
#define PWR_PUCRH_PH11_Msk           (0x1UL << PWR_PUCRH_PH11_Pos)             /*!< 0x00000800 */
#define PWR_PUCRH_PH11               PWR_PUCRH_PH11_Msk                        /*!< Port PH11 Pull-Up set  */
#define PWR_PUCRH_PH10_Pos           (10U)
#define PWR_PUCRH_PH10_Msk           (0x1UL << PWR_PUCRH_PH10_Pos)             /*!< 0x00000400 */
#define PWR_PUCRH_PH10               PWR_PUCRH_PH10_Msk                        /*!< Port PH10 Pull-Up set  */
#define PWR_PUCRH_PH9_Pos            (9U)
#define PWR_PUCRH_PH9_Msk            (0x1UL << PWR_PUCRH_PH9_Pos)              /*!< 0x00000200 */
#define PWR_PUCRH_PH9                PWR_PUCRH_PH9_Msk                         /*!< Port PH9 Pull-Up set  */
#define PWR_PUCRH_PH8_Pos            (8U)
#define PWR_PUCRH_PH8_Msk            (0x1UL << PWR_PUCRH_PH8_Pos)              /*!< 0x00000100 */
#define PWR_PUCRH_PH8                PWR_PUCRH_PH8_Msk                         /*!< Port PH8 Pull-Up set  */
#define PWR_PUCRH_PH7_Pos            (7U)
#define PWR_PUCRH_PH7_Msk            (0x1UL << PWR_PUCRH_PH7_Pos)              /*!< 0x00000080 */
#define PWR_PUCRH_PH7                PWR_PUCRH_PH7_Msk                         /*!< Port PH7 Pull-Up set  */
#define PWR_PUCRH_PH6_Pos            (6U)
#define PWR_PUCRH_PH6_Msk            (0x1UL << PWR_PUCRH_PH6_Pos)              /*!< 0x00000040 */
#define PWR_PUCRH_PH6                PWR_PUCRH_PH6_Msk                         /*!< Port PH6 Pull-Up set  */
#define PWR_PUCRH_PH5_Pos            (5U)
#define PWR_PUCRH_PH5_Msk            (0x1UL << PWR_PUCRH_PH5_Pos)              /*!< 0x00000020 */
#define PWR_PUCRH_PH5                PWR_PUCRH_PH5_Msk                         /*!< Port PH5 Pull-Up set  */
#define PWR_PUCRH_PH4_Pos            (4U)
#define PWR_PUCRH_PH4_Msk            (0x1UL << PWR_PUCRH_PH4_Pos)              /*!< 0x00000010 */
#define PWR_PUCRH_PH4                PWR_PUCRH_PH4_Msk                         /*!< Port PH4 Pull-Up set  */
#define PWR_PUCRH_PH3_Pos            (3U)
#define PWR_PUCRH_PH3_Msk            (0x1UL << PWR_PUCRH_PH3_Pos)              /*!< 0x00000008 */
#define PWR_PUCRH_PH3                PWR_PUCRH_PH3_Msk                         /*!< Port PH3 Pull-Up set  */
#define PWR_PUCRH_PH2_Pos            (2U)
#define PWR_PUCRH_PH2_Msk            (0x1UL << PWR_PUCRH_PH2_Pos)              /*!< 0x00000004 */
#define PWR_PUCRH_PH2                PWR_PUCRH_PH2_Msk                         /*!< Port PH2 Pull-Up set  */
#define PWR_PUCRH_PH1_Pos            (1U)
#define PWR_PUCRH_PH1_Msk            (0x1UL << PWR_PUCRH_PH1_Pos)              /*!< 0x00000002 */
#define PWR_PUCRH_PH1                PWR_PUCRH_PH1_Msk                         /*!< Port PH1 Pull-Up set  */
#define PWR_PUCRH_PH0_Pos            (0U)
#define PWR_PUCRH_PH0_Msk            (0x1UL << PWR_PUCRH_PH0_Pos)              /*!< 0x00000001 */
#define PWR_PUCRH_PH0                PWR_PUCRH_PH0_Msk                         /*!< Port PH0 Pull-Up set  */

/********************  Bit definition for PWR_PDCRH register  ********************/
#define PWR_PDCRH_PH15_Pos           (15U)
#define PWR_PDCRH_PH15_Msk           (0x1UL << PWR_PDCRH_PH15_Pos)             /*!< 0x00008000 */
#define PWR_PDCRH_PH15               PWR_PDCRH_PH15_Msk                        /*!< Port PH15 Pull-Down set  */
#define PWR_PDCRH_PH14_Pos           (14U)
#define PWR_PDCRH_PH14_Msk           (0x1UL << PWR_PDCRH_PH14_Pos)             /*!< 0x00004000 */
#define PWR_PDCRH_PH14               PWR_PDCRH_PH14_Msk                        /*!< Port PH14 Pull-Down set  */
#define PWR_PDCRH_PH13_Pos           (13U)
#define PWR_PDCRH_PH13_Msk           (0x1UL << PWR_PDCRH_PH13_Pos)             /*!< 0x00002000 */
#define PWR_PDCRH_PH13               PWR_PDCRH_PH13_Msk                        /*!< Port PH13 Pull-Down set  */
#define PWR_PDCRH_PH12_Pos           (12U)
#define PWR_PDCRH_PH12_Msk           (0x1UL << PWR_PDCRH_PH12_Pos)             /*!< 0x00001000 */
#define PWR_PDCRH_PH12               PWR_PDCRH_PH12_Msk                        /*!< Port PH12 Pull-Down set  */
#define PWR_PDCRH_PH11_Pos           (11U)
#define PWR_PDCRH_PH11_Msk           (0x1UL << PWR_PDCRH_PH11_Pos)             /*!< 0x00000800 */
#define PWR_PDCRH_PH11               PWR_PDCRH_PH11_Msk                        /*!< Port PH11 Pull-Down set  */
#define PWR_PDCRH_PH10_Pos           (10U)
#define PWR_PDCRH_PH10_Msk           (0x1UL << PWR_PDCRH_PH10_Pos)             /*!< 0x00000400 */
#define PWR_PDCRH_PH10               PWR_PDCRH_PH10_Msk                        /*!< Port PH10 Pull-Down set  */
#define PWR_PDCRH_PH9_Pos            (9U)
#define PWR_PDCRH_PH9_Msk            (0x1UL << PWR_PDCRH_PH9_Pos)              /*!< 0x00000200 */
#define PWR_PDCRH_PH9                PWR_PDCRH_PH9_Msk                         /*!< Port PH9 Pull-Down set  */
#define PWR_PDCRH_PH8_Pos            (8U)
#define PWR_PDCRH_PH8_Msk            (0x1UL << PWR_PDCRH_PH8_Pos)              /*!< 0x00000100 */
#define PWR_PDCRH_PH8                PWR_PDCRH_PH8_Msk                         /*!< Port PH8 Pull-Down set  */
#define PWR_PDCRH_PH7_Pos            (7U)
#define PWR_PDCRH_PH7_Msk            (0x1UL << PWR_PDCRH_PH7_Pos)              /*!< 0x00000080 */
#define PWR_PDCRH_PH7                PWR_PDCRH_PH7_Msk                         /*!< Port PH7 Pull-Down set  */
#define PWR_PDCRH_PH6_Pos            (6U)
#define PWR_PDCRH_PH6_Msk            (0x1UL << PWR_PDCRH_PH6_Pos)              /*!< 0x00000040 */
#define PWR_PDCRH_PH6                PWR_PDCRH_PH6_Msk                         /*!< Port PH6 Pull-Down set  */
#define PWR_PDCRH_PH5_Pos            (5U)
#define PWR_PDCRH_PH5_Msk            (0x1UL << PWR_PDCRH_PH5_Pos)              /*!< 0x00000020 */
#define PWR_PDCRH_PH5                PWR_PDCRH_PH5_Msk                         /*!< Port PH5 Pull-Down set  */
#define PWR_PDCRH_PH4_Pos            (4U)
#define PWR_PDCRH_PH4_Msk            (0x1UL << PWR_PDCRH_PH4_Pos)              /*!< 0x00000010 */
#define PWR_PDCRH_PH4                PWR_PDCRH_PH4_Msk                         /*!< Port PH4 Pull-Down set  */
#define PWR_PDCRH_PH3_Pos            (3U)
#define PWR_PDCRH_PH3_Msk            (0x1UL << PWR_PDCRH_PH3_Pos)              /*!< 0x00000008 */
#define PWR_PDCRH_PH3                PWR_PDCRH_PH3_Msk                         /*!< Port PH3 Pull-Down set  */
#define PWR_PDCRH_PH2_Pos            (2U)
#define PWR_PDCRH_PH2_Msk            (0x1UL << PWR_PDCRH_PH2_Pos)              /*!< 0x00000004 */
#define PWR_PDCRH_PH2                PWR_PDCRH_PH2_Msk                         /*!< Port PH1 Pull-Down set  */
#define PWR_PDCRH_PH1_Pos            (1U)
#define PWR_PDCRH_PH1_Msk            (0x1UL << PWR_PDCRH_PH1_Pos)              /*!< 0x00000002 */
#define PWR_PDCRH_PH1                PWR_PDCRH_PH1_Msk                         /*!< Port PH1 Pull-Down set  */
#define PWR_PDCRH_PH0_Pos            (0U)
#define PWR_PDCRH_PH0_Msk            (0x1UL << PWR_PDCRH_PH0_Pos)              /*!< 0x00000001 */
#define PWR_PDCRH_PH0                PWR_PDCRH_PH0_Msk                         /*!< Port PH0 Pull-Down set  */

/********************  Bit definition for PWR_PUCRI register  ********************/
#define PWR_PUCRI_PI11_Pos           (11U)
#define PWR_PUCRI_PI11_Msk           (0x1UL << PWR_PUCRI_PI11_Pos)             /*!< 0x00000800 */
#define PWR_PUCRI_PI11               PWR_PUCRI_PI11_Msk                        /*!< Port PI11 Pull-Up set */
#define PWR_PUCRI_PI10_Pos           (10U)
#define PWR_PUCRI_PI10_Msk           (0x1UL << PWR_PUCRI_PI10_Pos)             /*!< 0x00000400 */
#define PWR_PUCRI_PI10               PWR_PUCRI_PI10_Msk                        /*!< Port PI10 Pull-Up set */
#define PWR_PUCRI_PI9_Pos            (9U)
#define PWR_PUCRI_PI9_Msk            (0x1UL << PWR_PUCRI_PI9_Pos)              /*!< 0x00000200 */
#define PWR_PUCRI_PI9                PWR_PUCRI_PI9_Msk                         /*!< Port PI9 Pull-Up set  */
#define PWR_PUCRI_PI8_Pos            (8U)
#define PWR_PUCRI_PI8_Msk            (0x1UL << PWR_PUCRI_PI8_Pos)              /*!< 0x00000100 */
#define PWR_PUCRI_PI8                PWR_PUCRI_PI8_Msk                         /*!< Port PI8 Pull-Up set  */
#define PWR_PUCRI_PI7_Pos            (7U)
#define PWR_PUCRI_PI7_Msk            (0x1UL << PWR_PUCRI_PI7_Pos)              /*!< 0x00000080 */
#define PWR_PUCRI_PI7                PWR_PUCRI_PI7_Msk                         /*!< Port PI7 Pull-Up set  */
#define PWR_PUCRI_PI6_Pos            (6U)
#define PWR_PUCRI_PI6_Msk            (0x1UL << PWR_PUCRI_PI6_Pos)              /*!< 0x00000040 */
#define PWR_PUCRI_PI6                PWR_PUCRI_PI6_Msk                         /*!< Port PI6 Pull-Up set  */
#define PWR_PUCRI_PI5_Pos            (5U)
#define PWR_PUCRI_PI5_Msk            (0x1UL << PWR_PUCRI_PI5_Pos)              /*!< 0x00000020 */
#define PWR_PUCRI_PI5                PWR_PUCRI_PI5_Msk                         /*!< Port PI5 Pull-Up set  */
#define PWR_PUCRI_PI4_Pos            (4U)
#define PWR_PUCRI_PI4_Msk            (0x1UL << PWR_PUCRI_PI4_Pos)              /*!< 0x00000010 */
#define PWR_PUCRI_PI4                PWR_PUCRI_PI4_Msk                         /*!< Port PI4 Pull-Up set  */
#define PWR_PUCRI_PI3_Pos            (3U)
#define PWR_PUCRI_PI3_Msk            (0x1UL << PWR_PUCRI_PI3_Pos)              /*!< 0x00000008 */
#define PWR_PUCRI_PI3                PWR_PUCRI_PI3_Msk                         /*!< Port PI3 Pull-Up set  */
#define PWR_PUCRI_PI2_Pos            (2U)
#define PWR_PUCRI_PI2_Msk            (0x1UL << PWR_PUCRI_PI2_Pos)              /*!< 0x00000004 */
#define PWR_PUCRI_PI2                PWR_PUCRI_PI2_Msk                         /*!< Port PI2 Pull-Up set  */
#define PWR_PUCRI_PI1_Pos            (1U)
#define PWR_PUCRI_PI1_Msk            (0x1UL << PWR_PUCRI_PI1_Pos)              /*!< 0x00000002 */
#define PWR_PUCRI_PI1                PWR_PUCRI_PI1_Msk                         /*!< Port PI1 Pull-Up set  */
#define PWR_PUCRI_PI0_Pos            (0U)
#define PWR_PUCRI_PI0_Msk            (0x1UL << PWR_PUCRI_PI0_Pos)              /*!< 0x00000001 */
#define PWR_PUCRI_PI0                PWR_PUCRI_PI0_Msk                         /*!< Port PI0 Pull-Up set  */

/********************  Bit definition for PWR_PDCRI register  ********************/
#define PWR_PDCRI_PI11_Pos           (11U)
#define PWR_PDCRI_PI11_Msk           (0x1UL << PWR_PDCRI_PI11_Pos)             /*!< 0x00000800 */
#define PWR_PDCRI_PI11               PWR_PDCRI_PI11_Msk                        /*!< Port PI11 Pull-Down set */
#define PWR_PDCRI_PI10_Pos           (10U)
#define PWR_PDCRI_PI10_Msk           (0x1UL << PWR_PDCRI_PI10_Pos)             /*!< 0x00000400 */
#define PWR_PDCRI_PI10               PWR_PDCRI_PI10_Msk                        /*!< Port PI10 Pull-Down set */
#define PWR_PDCRI_PI9_Pos            (9U)
#define PWR_PDCRI_PI9_Msk            (0x1UL << PWR_PDCRI_PI9_Pos)              /*!< 0x00000200 */
#define PWR_PDCRI_PI9                PWR_PDCRI_PI9_Msk                         /*!< Port PI9 Pull-Down set  */
#define PWR_PDCRI_PI8_Pos            (8U)
#define PWR_PDCRI_PI8_Msk            (0x1UL << PWR_PDCRI_PI8_Pos)              /*!< 0x00000100 */
#define PWR_PDCRI_PI8                PWR_PDCRI_PI8_Msk                         /*!< Port PI8 Pull-Down set  */
#define PWR_PDCRI_PI7_Pos            (7U)
#define PWR_PDCRI_PI7_Msk            (0x1UL << PWR_PDCRI_PI7_Pos)              /*!< 0x00000080 */
#define PWR_PDCRI_PI7                PWR_PDCRI_PI7_Msk                         /*!< Port PI7 Pull-Down set  */
#define PWR_PDCRI_PI6_Pos            (6U)
#define PWR_PDCRI_PI6_Msk            (0x1UL << PWR_PDCRI_PI6_Pos)              /*!< 0x00000040 */
#define PWR_PDCRI_PI6                PWR_PDCRI_PI6_Msk                         /*!< Port PI6 Pull-Down set  */
#define PWR_PDCRI_PI5_Pos            (5U)
#define PWR_PDCRI_PI5_Msk            (0x1UL << PWR_PDCRI_PI5_Pos)              /*!< 0x00000020 */
#define PWR_PDCRI_PI5                PWR_PDCRI_PI5_Msk                         /*!< Port PI5 Pull-Down set  */
#define PWR_PDCRI_PI4_Pos            (4U)
#define PWR_PDCRI_PI4_Msk            (0x1UL << PWR_PDCRI_PI4_Pos)              /*!< 0x00000010 */
#define PWR_PDCRI_PI4                PWR_PDCRI_PI4_Msk                         /*!< Port PI4 Pull-Down set  */
#define PWR_PDCRI_PI3_Pos            (3U)
#define PWR_PDCRI_PI3_Msk            (0x1UL << PWR_PDCRI_PI3_Pos)              /*!< 0x00000008 */
#define PWR_PDCRI_PI3                PWR_PDCRI_PI3_Msk                         /*!< Port PI3 Pull-Down set  */
#define PWR_PDCRI_PI2_Pos            (2U)
#define PWR_PDCRI_PI2_Msk            (0x1UL << PWR_PDCRI_PI2_Pos)              /*!< 0x00000004 */
#define PWR_PDCRI_PI2                PWR_PDCRI_PI2_Msk                         /*!< Port PI2 Pull-Down set  */
#define PWR_PDCRI_PI1_Pos            (1U)
#define PWR_PDCRI_PI1_Msk            (0x1UL << PWR_PDCRI_PI1_Pos)              /*!< 0x00000002 */
#define PWR_PDCRI_PI1                PWR_PDCRI_PI1_Msk                         /*!< Port PI1 Pull-Down set  */
#define PWR_PDCRI_PI0_Pos            (0U)
#define PWR_PDCRI_PI0_Msk            (0x1UL << PWR_PDCRI_PI0_Pos)              /*!< 0x00000001 */
#define PWR_PDCRI_PI0                PWR_PDCRI_PI0_Msk                         /*!< Port PI0 Pull-Down set  */

/********************  Bit definition for PWR_CR5 register  ********************/
#define PWR_CR5_R1MODE_Pos           (8U)
#define PWR_CR5_R1MODE_Msk           (0x1UL << PWR_CR5_R1MODE_Pos)             /*!< 0x00000100 */
#define PWR_CR5_R1MODE               PWR_CR5_R1MODE_Msk                        /*!< Range 1 normal mode */


/******************************************************************************/
/*                                                                            */
/*                         Reset and Clock Control                            */
/*                                                                            */
/******************************************************************************/
/*
* @brief Specific device feature definitions  (not present on all devices in the STM32L4 series)
*/
#define RCC_PLLSAI1_SUPPORT
#define RCC_PLLP_SUPPORT
#define RCC_HSI48_SUPPORT
#define RCC_PLLM_DIV_1_16_SUPPORT
#define RCC_PLLP_DIV_2_31_SUPPORT
#define RCC_PLLSAI1N_MUL_8_127_SUPPORT
#define RCC_PLLSAI1M_DIV_1_16_SUPPORT
#define RCC_PLLSAI1P_DIV_2_31_SUPPORT
#define RCC_PLLSAI2_SUPPORT
#define RCC_PLLSAI2N_MUL_8_127_SUPPORT
#define RCC_PLLSAI2M_DIV_1_16_SUPPORT
#define RCC_PLLSAI2P_DIV_2_31_SUPPORT
#define RCC_PLLSAI2Q_DIV_SUPPORT

/********************  Bit definition for RCC_CR register  ********************/
#define RCC_CR_MSION_Pos                     (0U)
#define RCC_CR_MSION_Msk                     (0x1UL << RCC_CR_MSION_Pos)       /*!< 0x00000001 */
#define RCC_CR_MSION                         RCC_CR_MSION_Msk                  /*!< Internal Multi Speed oscillator (MSI) clock enable */
#define RCC_CR_MSIRDY_Pos                    (1U)
#define RCC_CR_MSIRDY_Msk                    (0x1UL << RCC_CR_MSIRDY_Pos)      /*!< 0x00000002 */
#define RCC_CR_MSIRDY                        RCC_CR_MSIRDY_Msk                 /*!< Internal Multi Speed oscillator (MSI) clock ready flag */
#define RCC_CR_MSIPLLEN_Pos                  (2U)
#define RCC_CR_MSIPLLEN_Msk                  (0x1UL << RCC_CR_MSIPLLEN_Pos)    /*!< 0x00000004 */
#define RCC_CR_MSIPLLEN                      RCC_CR_MSIPLLEN_Msk               /*!< Internal Multi Speed oscillator (MSI) PLL enable */
#define RCC_CR_MSIRGSEL_Pos                  (3U)
#define RCC_CR_MSIRGSEL_Msk                  (0x1UL << RCC_CR_MSIRGSEL_Pos)    /*!< 0x00000008 */
#define RCC_CR_MSIRGSEL                      RCC_CR_MSIRGSEL_Msk               /*!< Internal Multi Speed oscillator (MSI) range selection */

/*!< MSIRANGE configuration : 12 frequency ranges available */
#define RCC_CR_MSIRANGE_Pos                  (4U)
#define RCC_CR_MSIRANGE_Msk                  (0xFUL << RCC_CR_MSIRANGE_Pos)    /*!< 0x000000F0 */
#define RCC_CR_MSIRANGE                      RCC_CR_MSIRANGE_Msk               /*!< Internal Multi Speed oscillator (MSI) clock Range */
#define RCC_CR_MSIRANGE_0                    (0x0UL << RCC_CR_MSIRANGE_Pos)    /*!< 0x00000000 */
#define RCC_CR_MSIRANGE_1                    (0x1UL << RCC_CR_MSIRANGE_Pos)    /*!< 0x00000010 */
#define RCC_CR_MSIRANGE_2                    (0x2UL << RCC_CR_MSIRANGE_Pos)    /*!< 0x00000020 */
#define RCC_CR_MSIRANGE_3                    (0x3UL << RCC_CR_MSIRANGE_Pos)    /*!< 0x00000030 */
#define RCC_CR_MSIRANGE_4                    (0x4UL << RCC_CR_MSIRANGE_Pos)    /*!< 0x00000040 */
#define RCC_CR_MSIRANGE_5                    (0x5UL << RCC_CR_MSIRANGE_Pos)    /*!< 0x00000050 */
#define RCC_CR_MSIRANGE_6                    (0x6UL << RCC_CR_MSIRANGE_Pos)    /*!< 0x00000060 */
#define RCC_CR_MSIRANGE_7                    (0x7UL << RCC_CR_MSIRANGE_Pos)    /*!< 0x00000070 */
#define RCC_CR_MSIRANGE_8                    (0x8UL << RCC_CR_MSIRANGE_Pos)    /*!< 0x00000080 */
#define RCC_CR_MSIRANGE_9                    (0x9UL << RCC_CR_MSIRANGE_Pos)    /*!< 0x00000090 */
#define RCC_CR_MSIRANGE_10                   (0xAUL << RCC_CR_MSIRANGE_Pos)    /*!< 0x000000A0 */
#define RCC_CR_MSIRANGE_11                   (0xBUL << RCC_CR_MSIRANGE_Pos)    /*!< 0x000000B0 */

#define RCC_CR_HSION_Pos                     (8U)
#define RCC_CR_HSION_Msk                     (0x1UL << RCC_CR_HSION_Pos)       /*!< 0x00000100 */
#define RCC_CR_HSION                         RCC_CR_HSION_Msk                  /*!< Internal High Speed oscillator (HSI16) clock enable */
#define RCC_CR_HSIKERON_Pos                  (9U)
#define RCC_CR_HSIKERON_Msk                  (0x1UL << RCC_CR_HSIKERON_Pos)    /*!< 0x00000200 */
#define RCC_CR_HSIKERON                      RCC_CR_HSIKERON_Msk               /*!< Internal High Speed oscillator (HSI16) clock enable for some IPs Kernel */
#define RCC_CR_HSIRDY_Pos                    (10U)
#define RCC_CR_HSIRDY_Msk                    (0x1UL << RCC_CR_HSIRDY_Pos)      /*!< 0x00000400 */
#define RCC_CR_HSIRDY                        RCC_CR_HSIRDY_Msk                 /*!< Internal High Speed oscillator (HSI16) clock ready flag */
#define RCC_CR_HSIASFS_Pos                   (11U)
#define RCC_CR_HSIASFS_Msk                   (0x1UL << RCC_CR_HSIASFS_Pos)     /*!< 0x00000800 */
#define RCC_CR_HSIASFS                       RCC_CR_HSIASFS_Msk                /*!< HSI16 Automatic Start from Stop */

